---
title: Data Type(List, Tuple, Dictionary, Set)[Python]
date: 2023-02-08 22:17:00 +0900
categories: [python, study]
tags: [python, data type]     # TAG names should always be lowercase
pin: True
---

# Python의 자료형(List, Tuple, Dictionary, Set)
Python 스터디로 [점프 투 파이썬](https://wikidocs.net/11)을 2주에 걸쳐 정리하기로 했다. 이 post에서는 나머지 자료형에 대해 정리한다. 점프 투 파이썬을 기반으로 실제로 공부하면서 궁금했던 것을 추가하면서 작성 할 예정이다.

## List
List는 여러 요소를 쉽게 컨트롤 할 수 있게 해주는 자료형이다. 모든 자료형을 리스트의 요소로 사용할 수 있다.
#### 리스트 선언
리스트의 선언은 요소들을 대괄호로 감싸주고, 각 요소를 쉼표로 구분해줌으로써 선언 할 수 있다.
```
> number = [1, 2, 3, 4]
```
그러고 다양한 자료형을 요소로 사용 할 수 있다.

```
> a = []
> b = [1, 2, 3]
> c = ['Life', 'is', 'too', 'short']
> d = [1, 2, 'Gongsoo']
> e = [1, 2, [1, 2]]
```

a와 같이 선언하면 비어있는 리스트를 만들 수 있고, 문자열을 요소로, 또 숫자와 문자열을 같이 요솟값을 가질 수 있다.
e처럼 리스트를 요소로 가질 수도 있다.

### 리스트 인덱싱과 슬라이싱
리스트도 문자열처럼 인덱싱과 슬라이싱이 가능하다. 인덱싱은 요소의 자료형으로 반환하고 슬라이싱은 리스트로 반환한다. 
문자열과 같이 음수값으로 인덱싱도 가능하다.
```
> a = [1, 2, 3]
> a[0]
1
> a[0:2]
[1, 2]
```
\# 이중 리스트에서 인덱싱과 슬라이싱
```
> a = [[1, 2],[3, 4]]
> a[0][0]
1
> a[0][:]
[1, 2]
```


### 리스트 연산
문자열과 같이 + 기호로 더할 수 있고, *기호를 사용해서 반복할 수 있다.
```
> a = [1, 2]
> a * 3
[1, 2, 1, 2, 1, 2]
> a + a
[1, 2, 1, 2]
``` 
### 리스트의 수정, 삭제
문자열과 **달리** 값을 수정할 수 있다.
```
> a = [1, 2, 3]
> a[1] = 100
> a
[1, 100, 3]
```
삭제는 del 함수를 사용해 삭제 할 수 있다.슬라이싱 기법을 이용해 여러 개를 한 번에 삭제할 수 있다. 
```
> a = [1, 2, 3]
> del a[1]
> a
[1, 3]
```
### 리스트 관련 함수
함수가 많다..
#### append()
리스트의 맨 마지막에 요소를 추가하는 함수. 요소는 모든 자료형도 추가할 수 있다.
```
> a = [1, 2]
> a.append(3)
> a
[1, 2, 3]
```
#### sort(), sorted(list)
기본적으로 오름차순으로 정렬해준다. 숫자, 문자 다 가능. sort(reverse = True), sorted(list, reverse = True)로도 내림차순으로도 가능
```
> a = [4, 1, 3, 2]
> a.sort()
> a
[1, 2, 3, 4]
```
```
> a = ['b', 'a', 'c']
> sorted(a)
['a', 'b', 'c']
```
#### reverse()
리스트 요소를 거꾸로해준다.
```
> a = [4, 1, 3, 2]
> a.reverse()
> a
[2, 3, 1, 4]
```
#### index()
리스트의 요소값이 몇번째인지 반환해준다.
```
> a = [4, 1, 3, 2]
> a.index(1)
1
```
#### insert(a, b)
리스트의 a번째 위치에 b를 삽입하는 함수이다.
```
> a = [4, 1, 3, 2]
> a.insert(0,100)
> a
[100, 4, 1, 3, 2]
```
#### remove()
remove(x)는 리스트에서 첫번째 나오는 x를 삭제하는 함수이다. del과의 차이점은 del은 **인덱스**를 사용해서 삭제하고 remove()는 **요소**를 사용해서 삭제한다.
```
> a = [4, 1, 3, 2]
> a.remove(1)
> a
[4, 3, 2]
```
#### pop()
괄호안이 비어있으면 제일 마지막 요소를 **리턴**하고 삭제한다. 괄호 안에 인덱스를 넣으면 해당 인덱스 값을 리턴하고 삭제한다.
```
> a = [4, 1, 3, 2]
> a.pop()
2
> a
[4, 1, 3]
``` 
#### count()
count(x)는 리스트 안에 x가 몇 개 있는지 반환하는 함수이다.
```
> a = [1, 1, 3, 2]
> a.count(1)
2
```
#### extend()
점프 투 파이썬에서는 리스트만 extend할 수 있다고 했지만, 문자열도 올 수 있다.
```
> a = [1, 2, 3]
> b = [4, 5]
> a.extend(b)
> a
[1, 2, 3, 4, 5]
> a.extend('ab')
> a
[1, 2, 3, 4, 5, 'a', 'b']
```
append()와의 차이점은 append()는 받은 요솟값을 바로 추가 한다면 extend()는 위의 예시처럼 리스트나 문자열의 한 꺼풀 안쪽의 요소를 추가시킨다.
예를 들어, 리스트 안에 리스트를 extend로 추가하고 싶다면 extend([[list]])를 하면 된다.
______________
## Tuple
튜플은 몇 가지 제외하고 리스트와 거의 비슷하지만,

 - 튜플은 ()로 둘러싼다.
 - 튜플의 요소는 바꿀 수 없다.

```
> a = ()
> b = (1, )
> c = 1, 2, 3
> d = (1, 2, [1, 2])
```
리스트와 비슷하지만 튜플은 한가지 요소를 가질 때는 뒤에 쉼표를 반드시 붙여야하고, c처럼 괄호를 생략해도 된다.

프로그램이 실행되는 동안 요솟값이 변하지 않기를 바라면 리스트 대신 튜플을 사용하자.

## Dictionary
사람은 누구든지 "이름" = "홍길동", "생일" = "몇 월 며칠" 등으로 나타낼 수 있다. 파이썬은 영리하게도 이러한 대응 관계를 나타낼 수 있는 자료형을 가지고 있다. 요즘 사용하는 대부분의 언어도 이러한 대응 관계를 나타내는 자료형을 갖고 있는데, 이를 연관 배열(Associative array) 또는 해시(Hash)라고 한다.

파이썬에서는 이러한 자료형을 딕셔너리(Dictionary)라고 하는데, 단어 그대로 해석하면 사전이라는 뜻이다. 즉 "people"이라는 단어에 "사람", "baseball"이라는 단어에 "야구"라는 뜻이 부합되듯이 딕셔너리는 Key와 Value를 한 쌍으로 갖는 자료형이다. 예컨대 Key가 "baseball"이라면 Value는 "야구"가 될 것이다.

딕셔너리는 리스트나 튜플처럼 순차적으로(sequential) 해당 요솟값을 구하지 않고 Key를 통해 Value를 얻는다. 이것이 바로 딕셔너리의 가장 큰 특징이다. baseball이라는 단어의 뜻을 찾기 위해 사전의 내용을 순차적으로 모두 검색하는 것이 아니라 baseball이라는 단어가 있는 곳만 펼쳐 보는 것이다.

### 딕셔너리 생성
dictionary의 기본 모습은 다음과 같다.
```
{key1:value1, key2:value2, ...
```
key는 딕셔너리에서 value를 불러올 수 있는 요소이다. key는 정수, 문자열, 튜플을 사용 할 수 있고, value는 문자열, 숫자, 리스트 등도 넣을 수 있다.
```
> a = {}
```
이와같이 빈 dictionary를 생성할 수 있다.

### 딕셔너리 쌍 추가, 삭제
#### 딕셔너리 쌍 추가하기
```
> dict = {1: 'a'}
> dict[2] = 'b'
> dict
{1: 'a', 2: 'b'}
> dict[3]
KeyError: 3
```
dict[2] = 'b'와 같이 입력하면 딕셔너리에 Key와 Value가 추가된다.
하지만 딕셔너리에 없는 키를 불러오면 위와같이 KeyError가 발생한다.

#### 딕셔너리 요소 삭제하기
```
> del a[0]
> a
{2: 'b'}
```
리스트나 문자열과 같이 인덱스로 삭제하는 del 함수로 삭제가 가능하다.

### 딕셔너리 관련 함수들
#### keys()
```
> a = {'name': 'pey', 'phone': '010-9999-1234', 'birth': '1118'} 
> a.keys()
dict_keys(['name', 'phone', 'birth'])
```
**주의** 위에서 반환하는 객체는 List가 아니다!! 리스트로 사용하려면 list(a.keys())와 같이 사용 할 수 있다. 리스트가 아니더라도 for문 등 반복 구문에서 사용할 수 있다.
#### values()
keys()와 마찬가지로 Value값만 객체로 반환해준다.
```
> a.values()
dict_values(['pey', '010-9999-1234', '1118'])
```
#### items()
Key와 Value의 쌍을 **튜플**로 묶어 객체로 반환한다.
```
> a.items()
dict_items([('name', 'pey'), ('phone', '010-9999-1234'), ('birth', '1118')])
```
## Set
이거 수학이다.. 집합과 관련된 것을 쉽게 처리하거나, 특히 **중복된 요소 제거**할 때 많이 사용한다.
### Set자료형 생성
```
> s = set([1,2,3])
> s
{1, 2, 3}
```
다음과 같이 문자열을 입력해서 만들 수 도 있다.
```
> s = set('Hello')
> s
{'o', 'H', 'l', 'e'}
```
비어있는 집합자료형은 set()으로 만들 수 있다. 
위의 예제처럼 순서가 바뀐다. 이 이유는 Set에는 순서가 없기 때문이다. 따라서 Set은 인덱싱을 지원하지 않는다.


### Set 관련 함수들

#### add()
이미 만들어진 set에 값을 **하나**만 추가할 때 사용한다.
```
> s = set([1, 2, 3])
> s.add(4)
> s
{1, 2, 3, 4}
```
#### update()
여러 개의 값을 한번에 추가 할 때 사용한다.
```
> s = set([1, 2, 3])
> s.add([4, 5, 6])
> s
{1, 2, 3, 4, 5, 6}
```
#### remove()
리스트와 마찬가지로 요소를 사용해서 제거한다.
```
> s = set([1, 2, 3])
> s.remove(2)
> s
{1, 3}
```
--------------------
## 마무리
변수는 나중에 객체에서 자세히 다룰 예정이다. 이로써 2장 요약을 마쳤다... 힘드로..